Introduction to Data Frames

In [7]:
import pandas as pd

df = pd.DataFrame([
    [1, 2, 3],
    [4, 5, 6],
    [8, 9, 10]
], columns=["A", "B", "C"]
, index = ["X", "Y", "Z"])

In [85]:
#df.head(2) First 2 rows
#df.tail(2)  Last 2 rows
#df.columns Headers
#df.index row indices
#df.info() Gives info on bytes or data types
#df.unique("A") Unique values in column A
#df.shape() Gives shape of the data frame row vs columns
#df.size() Total number of items
df.describe() #Gives data info on mean, stddev, median

              A         B          C
count  3.000000  3.000000   3.000000
mean   4.333333  5.333333   6.333333
std    3.511885  3.511885   3.511885
min    1.000000  2.000000   3.000000
25%    2.500000  3.500000   4.500000
50%    4.000000  5.000000   6.000000
75%    6.000000  7.000000   8.000000
max    8.000000  9.000000  10.000000

Loading Frames from Files

In [9]:
coffee = pd.read_csv("./warmup-data/coffee.csv")
results = pd.read_parquet("./data/results.parquet")
olympics_data = pd.read_excel("./data/olympics-data.xlsx", sheet_name = "results") #You can specify which excel sheet in that file
bios = pd.read_csv("./data/bios.csv")
#.to_excel, .to_xlsx to change the file type

Accessing Data with Pandas

In [82]:
coffee.head(10)
coffee #-> will print out everything, can also use display(coffee)
coffee.sample(10) #Gets 10 random
#coffee.loc[row_label, column_label] loc is name-based
#coffee.loc[0:3] Return the value and information at index names 0 to 3
#coffee.index = coffee.Day All the indices are set to their corresponding days
coffee.iloc[:, [0,2]] #iloc is postion-based

                 Day  Units Sold
Day
Monday        Monday          25
Monday        Monday          15
Tuesday      Tuesday          30
Tuesday      Tuesday          20
Wednesday  Wednesday          35
Wednesday  Wednesday          25
Thursday    Thursday          40
Thursday    Thursday          30
Friday        Friday          45
Friday        Friday          35
Saturday    Saturday          45
Saturday    Saturday          35
Sunday        Sunday          45
Sunday        Sunday          35

In [ ]:
#coffee.at[0, "Units Sold"]  Returns the value at the row-column intersection
coffee.iat[0, 1] #Integer based searching
#iat and at are optimized to search for a single value

'Espresso'

In [ ]:
#coffee.Day gets the Day column but only works if one word
#coffee["Units Sold"] to get the Units Sold row

In [ ]:
#coffee.sort_values("Units Sold", ascending = False) Sorting by Units sold column, ascending = True/False to reorder
coffee.sort_values(["Units Sold", "Coffee Type"]) #Sort by Units Sold then Coffee Type

In [ ]:
#Iteration: Not recommended
for index, row in coffee.iterrows():
    print(index)
    print(row)
    print("\n\n")

Filtering Data

In [ ]:
bios[(bios['height_cm'] > 215) & (bios['born_country'] == "USA")] #Filter the rows based on a condition
bios[bios['name'].str.contains("Keith|Patrick", case = False)] #Filter for string Keith or Patrick
#Can do much more with regular expressions
bios[(bios['born_country'].isin(["USA", "FRA", "GBR"])) & (bios['name'].str.startswith("Michael"))]

,athlete_id,name,born_date,born_city,born_region,born_country,NOC,height_cm,weight_kg,died_date
2737,2749,Michael Chang,1972-02-22,Hoboken,New Jersey,USA,United States,175.0,72.0,NaN
3239,3251,Michael Tucker,1971-06-25,South Boston,Massachusetts,USA,United States,188.0,84.0,NaN
8589,8636,Michael Carbajal,1967-09-17,Phoenix,Arizona,USA,United States,165.0,48.0,NaN
9706,9761,Michael Mean,1947-02-18,Hertford,England,GBR,Great Britain,180.0,76.0,NaN
11006,11063,Michael Budrock,1929-09-03,Yonkers,New York,USA,United States,NaN,NaN,1998-02-13
...,...,...,...,...,...,...,...,...,...,...
140344,143851,Michaela Walsh,1993-06-05,Belfast,Northern Ireland,GBR,Ireland,NaN,NaN,NaN
143687,147341,Michael Cherry,1995-03-23,New York,New York,USA,United States,NaN,NaN,NaN
143688,147342,Michael Norman,1997-12-03,San Diego,California,USA,United States,185.0,78.0,NaN
143788,147444,Michael Grady,1996-10-22,Pittsburgh,Pennsylvania,USA,United States,196.0,91.0,NaN
143817,147473,Michael Andrew,1999-04-18,Edina,Minnesota,USA,United States,NaN,NaN,NaN

In [100]:
bios.query('born_country == "USA" & born_city == "Seattle"') #Another filter method is to use query

,athlete_id,name,born_date,born_city,born_region,born_country,NOC,height_cm,weight_kg,died_date
11030,11088,David Halpern,1955-08-18,Seattle,Washington,USA,United States,178.0,79.0,NaN
12800,12870,Todd Trewin,1958-04-20,Seattle,Washington,USA,United States,180.0,75.0,NaN
15476,15583,Scott McKinley,1968-10-15,Seattle,Washington,USA,United States,183.0,75.0,NaN
29079,29293,Joyce Tanac,1950-09-27,Seattle,Washington,USA,United States,156.0,49.0,NaN
31135,31371,Bill Kuhlemeier,1908-01-14,Seattle,Washington,USA,United States,NaN,NaN,2001-07-08
...,...,...,...,...,...,...,...,...,...,...
133392,136331,Hans Struzyna,1989-03-31,Seattle,Washington,USA,United States,188.0,91.0,NaN
135448,138662,Maude Davis Crossland,2003-03-19,Seattle,Washington,USA,Colombia,NaN,NaN,NaN
136993,140229,Jenell Berhorst,2003-12-13,Seattle,Washington,USA,United States,NaN,NaN,NaN
143507,147159,Nevin Harrison,2002-06-02,Seattle,Washington,USA,United States,175.0,73.0,NaN
145446,149169,Corinne Stoddard,2001-08-15,Seattle,Washington,USA,United States,NaN,NaN,NaN

Adding/Removing Columns

In [110]:
import numpy as np
coffee['price'] = 4.99 #Created a column called price 
coffee['new_price'] = np.where(coffee['Coffee Type'] == 'Espresso', 3.99, 5.99)
#Set price to 3.99 if Espresso else 5.99
coffee.drop(columns = ['price']) #Drops the price column
coffee['revenue'] = coffee['Units Sold'] * coffee['new_price'] #New column to calculate revenue
coffee = coffee.rename(columns = {'new_price': 'price'}) #Rename a column
coffee

                 Day Coffee Type  Units Sold  price  price  revenue
Day
Monday        Monday    Espresso          25   4.99   3.99    99.75
Monday        Monday       Latte          15   4.99   5.99    89.85
Tuesday      Tuesday    Espresso          30   4.99   3.99   119.70
Tuesday      Tuesday       Latte          20   4.99   5.99   119.80
Wednesday  Wednesday    Espresso          35   4.99   3.99   139.65
Wednesday  Wednesday       Latte          25   4.99   5.99   149.75
Thursday    Thursday    Espresso          40   4.99   3.99   159.60
Thursday    Thursday       Latte          30   4.99   5.99   179.70
Friday        Friday    Espresso          45   4.99   3.99   179.55
Friday        Friday       Latte          35   4.99   5.99   209.65
Saturday    Saturday    Espresso          45   4.99   3.99   179.55
Saturday    Saturday       Latte          35   4.99   5.99   209.65
Sunday        Sunday    Espresso          45   4.99   3.99   179.55
Sunday        Sunday       Latte          35   4.99   5.99   209.65

In [ ]:
bios_new = bios.copy()
bios_new['first_name'] = bios_new['name'].str.split(" ").str[0] #Create a new column of first name
bios_new.query('first_name == "Michael"')

,athlete_id,name,born_date,born_city,born_region,born_country,NOC,height_cm,weight_kg,died_date,first_name
145,146,Michael Helber,1970-10-04,Bochum,Nordrhein-Westfalen,GER,Germany,185.0,72.0,NaN,Michael
148,149,Michael Keck,1969-02-08,Fürth,Bayern,GER,Germany,186.0,78.0,NaN,Michael
160,161,Michael Stich,1968-10-18,Pinneberg,Schleswig-Holstein,GER,Germany,192.0,79.0,NaN,Michael
826,830,Michael Hyatt,1970-04-09,NaN,NaN,NaN,Jamaica,NaN,NaN,NaN,Michael
1220,1227,Michael Prevost,1953-06-05,Hameln,Niedersachsen,GER,Canada,176.0,71.0,NaN,Michael
...,...,...,...,...,...,...,...,...,...,...,...
144176,147854,Michael Föttinger,1997-06-12,Hallein,Salzburg,AUT,Austria,NaN,NaN,NaN,Michael
144501,148193,Michael Špaček,1997-04-09,Pardubice,Pardubický kraj,CZE,Czechia,180.0,NaN,NaN,Michael
144689,148387,Michael Salzer,1991-10-25,Stuttgart,Baden-Württemberg,GER,Germany,NaN,NaN,NaN,Michael
145196,148914,Michael Vogt,1997-12-29,Lachen,Schwyz,SUI,Switzerland,NaN,NaN,NaN,Michael
145226,148945,Michael Fora,1995-10-30,Giubiasco,Ticino,SUI,Switzerland,NaN,NaN,NaN,Michael

In [119]:
bios_new['born_datetime'] = pd.to_datetime(bios_new['born_date'])
#New column where born data is converted to datetime type
bios_new['born_year'] = bios_new['born_datetime'].dt.year #Extracts the year to make new column

bios_new[['name', 'born_year']]

bios_new.to_csv('./data/bios_new.csv') #saves the new version of our file

In [121]:
bios['height_category'] = bios['height_cm'].apply(lambda x: 'Short' if x < 165 else 'Average' if x < 185 else 'Tall')
#Lambda expression to classify heights
bios.head(4)

,athlete_id,name,born_date,born_city,born_region,born_country,NOC,height_cm,weight_kg,died_date,height_category
0,1,Jean-François Blanchy,1886-12-12,Bordeaux,Gironde,FRA,France,NaN,NaN,1960-10-02,Tall
1,2,Arnaud Boetsch,1969-04-01,Meulan,Yvelines,FRA,France,183.0,76.0,NaN,Average
2,3,Jean Borotra,1898-08-13,Biarritz,Pyrénées-Atlantiques,FRA,France,183.0,76.0,1994-07-17,Average
3,4,Jacques Brugnon,1895-05-11,Paris VIIIe,Paris,FRA,France,168.0,64.0,1978-03-20,Average